package oop;

public class Ex01 {
	/*
	 * OOP : Object Oriented Programming, 객체 지향 프로그래밍 
	 * ㄴ> 객체(=데이터)를 기준으로 데이터 간의 상호작용을 통해서 프로그램을 완성시키는 기법
	 * 
	 * Object 	: 객체, 표현할 수 있는 데이터를 모두 아우르는 말.
	 * Class 	: 클래스, 프로그램 내에서 객체를 표현하는 방식. 객체를 기술하는 도면
	 * Instance : 인스턴스, 클래스를 실제 메모리에 로딩한 상태. 즉, 객체가 실제로 생성된 형태
	 * 
	 * new 키워드 : 클래스를 통해서 인스턴스를 메모리에 생성하는 키워드
	 * 
	 * 클래스의 형태)
	 * class 클래스명 {
	 * 		1. 멤버 변수 : 필드, 속성
	 * 		2. 멤버 함수 : 메서드
	 * 		3. 정보 은닉 : 접근 제어 지시자
	 * 		4. 내부 클래스
	 * }
	 * 
	 * 
	 * 
	 */
}


































