package _abstract;

public class Summary {
	/*
	 * 다형성
	 * - 다양한 형태를 띈다는 의미
	 * - 상속과 오버라이딩을 통해서 구현된다
	 * - 하나의 메서드로 여러가지 다른 형태로 사용가능
	 * 
	 * 
	 * 추상 클래스
	 * - 클래스로써 상속을 위해서 존재한다.
	 * - 기존의 클래스에서 기능을 더욱 확장(= extends)시키기 위한 용도
	 * - 클래스는 단 하나만 상속 가능하다
	 * 
	 * 
	 * 인터페이스
	 * - 클래스는 아니고, 상속을 위해서 존재한다
	 * - 특정 기능을 구현(= implements)하기 위한 용도. ex) CompareAble == 비교 가능한 클래스다~
	 * - 인터페이스는 여러개 상속 가능하다
	 * 
	 * 
	 * 익명 클래스
	 * - 객체를 생성할 수 없는 추상클래스나, 인터페이스의 객체를 생성할 수 있게 한다.
	 * - 그 자리에서 바로, 추상 메서드를 구현해서 객체를 선언
	 * - 주된 사용처는 안드로이드 개발의 이벤트 처리에 사용
	 * 
	 * 
	 * 
	 */
}


















